#ifndef __MELAYERS_H_
#define __MELAYERS_H_
#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000
////////////////////////////////////////////////////////////////////////////////////////////////////
enum ELayer
{
	// первые четыре индекса должны соответсвовать EFloorType индексам 
	// (чтобы в редакторе правильно отбражались старые зоны)
	LID_FLOORS = 0,			//!< идентификатор слоя перекрытий
	LID_FLOORS_INTERM,	//!< идентификатор слоя промежуточных (на половине высоты этажа) перекрытий
	LID_SOLIDS,					//!< идентификатор слоя сплошных объектов
	LID_SOLIDS_INTERM,	//!< идентификатор слоя промежуточных (на половине высоты этажа) сплошных объектов

	LID_ROOMS,					//!< идентификатор слоя закрашивания комнат
	LID_RECT,						//!< идентификатор слоя расстановки темплейтов, юнитов, объектов
	LID_WALLS,					//!< идентификатор слоя стен
	LID_TILES,					//!< идентификатор слоя типов тайлов ландшафта
	LID_HEIGHTS,				//!< идентификатор слоя карты высот
	LID_ALPHA,					//!< идентификатор слоя карты альфа значений для смешивания высот
	LID_GRASS,  
	LID_GRASSCOLOR,
	LID_TERRCOLOR,
	LID_CELLAR,					//!< идентификатор слоя рисования дырок в террейне под зданием
	LID_WAYPOINTS,
	LID_SUBTEMPLATES,
	LID_UNITS,
	LID_OBJECTS,
	LID_SPOTS,
	LID_CAMERAS,
	LID_HOLES,
};
////////////////////////////////////////////////////////////////////////////////////////////////////
inline bool IsBuildingLayer( ELayer nID ) 
{ 
	return nID == LID_FLOORS || nID == LID_FLOORS_INTERM || nID == LID_SOLIDS 
		|| nID == LID_SOLIDS_INTERM || nID == LID_WALLS;
}
////////////////////////////////////////////////////////////////////////////////////////////////////
#endif // __MELAYERS_H_
